import React from 'react';
import { Carousel } from 'react-responsive-carousel';

const Testimonials = () => {
  const testimonials = [
    {
      index: 1,
      name: 'יפעת',
      text: 'יוליה המקסימה נקראה בדרכי ממש במקרה. אינני זוכרת בדיוק כבר איך זה קרה, אבל זה הגיע בדיוק בזמן. קיבלתי מרשם לקנאביס רפואי שכולל רישיון ומינון cbd ו thc. ניסיתי לקרוא את חוברת ההדרכה, ניסיתי לחפש מידע ברשת אך לא הצלחתי למצוא מענה מתאים. לא ידעתי איך להתחיל שימוש בקנאביס, מתי לקחת אותו, מה ההבדלים בין הסוגים, מה יכול יותר/ פחות להתאים. יוליה הייתה זמינה תמיד לשאלות, עשתה לי אינטייק בצורה מסודרת ואפילו שלחה סיכום מאוד מסודר. ניכר כי יש לה הרבה ידע ומקצועיות בתחום שרב הנסתר על הגלוי וכידוע במקרים האלה רופא נותן מרשם, לא הנחיות. כשידעתי שאני יכולה לפנות ליוליה בכל התלבטות, שינוי מינון, תופעות לוואי ועוד... הייתי הרבה יותר רגועה והצלחתי להגיע למינון המתאים והמדוייק עבורי. ממליצה לא להתלבט ולפנות אליה , אתם לא תצטערו על כך.❤️',
    },
    {
      index: 2,
      name: 'הראל י.',
      text: 'הגעתי ליוליה דרך רוקח של HiPharm שהמליץ לי עקב הכדורים הפסיכיאטרים שאני לוקח, הייתי צריך מישהו שמבין בקנאביס וללמד אותי איך לצרוך את התרופה(קנאביס) בצורה נכונה ואפקטיבית. יוליה בן אדם מקסים שמלווה אותי עד היום בנדיבות ואדיבות. אישה מאוד מאוד מקצועית ורואים את הידע הנרחב שלה ואני מרגיש בידיים טובות❤️',
    },
    {
      index: 3,
      name: 'הראל א.',
      text: 'לפני כמה חודשים, אמא שלי קיבלה אבחנה של מחלת הסרטן. אמא לא רצתה לעשות את כל הטיפולים הקונבנציונאלים, היא החליטה להשתמש בקאנביס רפואי ואז פגשתי את יוליה המקסימה :) יוליה ליוותה אותי ואת אימי בכל התהליך, מהרגע שהיינו צריכים להוציא רשיון ועד עכשיו האמת. ענתה לכל שאלה שהייתה לנו, עם המון סבלנות, כבוד, הקשבה והכי חשוב הכלה, שזה משהו שאני ואימי היינו זקוקים לו יותר מכל. יוליה תמיד הייתה זמינה לכל אורך הדרך לכל שאלה\\בקשה או התייעצות. תמיד קיבלתי הרגשה נעימה בכל פעם שפניתי. בנוסף, אציין שהמחיר לליווי הזה הוא כל כך מינימלי, שרציתי לשלם יותר, אבל כמובן שיוליה היקרה סירבה לכך עם חיוך. הליווי הזה מאוד הועיל, גם עם הקאנביס מבחינת אופן השימוש והמעקב וגם שיש מישהי שאכפת לה והיא מתעניינת ושואלת לשלומה של אימי, בלי קשר לטיפול, מתוך אנושיות ואכפתיות. אני ממליץ בחום גדול לפנות ליוליה ומבטיח שמי שיקח את שירותיה פשוט ירוויח.',
    },
    {
      index: 4,
      name: 'אורטל',
      text: 'את יוליה הכרתי במקרה, או שאולי לא במקרה? כי מאז שהכרתי אותה הרגשתי שמישהו שלח אותה במיוחד אליי... גיליתי בחורה עניינית אך לגמרי עוטפת. חכמה ומבינה בתחום הרפואי ויודעת לתת מענה, ואם לא, הולכת לבדוק וחוזרת עם מענה.. היא לימדה אותי המון ובעיקר הכילה בצורה מופלאה ! התחום הזה של הקנאביס מבלבל למי שלא מכיר אותו, והיא נותנת מידע בהתאם לכמה שאתה מעוניין לקבל בצורה כל כך יפה ומרוכזת שזה עשה לי הרבה סדר, וגם כשלא, זרקתי עליה משימה לחפש לי מה מתאים, והיא חזרה עם תשובות בהתאם לתשאול... בקיצור בחורה חכמה אנושית ומקסימה ! ואין עליה בליווי ובמקצועיות !',
    },

  ];

  return (
    <section className="text-center bg-#faf9f8 relative h-2/3 py-16 p-12">
      <div className="container mx-auto">
        <h2 className='text-3xl font-bold mb-4 text-green-900 relative hover:text-green-500 hover:scale-105 transition-all '>מטופלים מספרים 
        </h2>
        <Carousel
          showThumbs={false}
          autoPlay
          interval={7000}
          infiniteLoop
          showStatus={false}
          showIndicators={false}
        >
          {testimonials.map((testimonial) => (
            <div dir="rtl" key={testimonial.id}  className="bg-white rounded-lg ">
              <p>{testimonial.text}</p>
              <p className="text-gray-600 font-semibold mt-4">{testimonial.name}</p>
            </div>
          ))}
        </Carousel>
      </div>
    </section>
  );
};

export default Testimonials;

